# Salary Range For Employees

## Postgres Database Conection

### Function to Connect the Postgres Database

In [49]:
import pandas as pd
from sqlalchemy import create_engine
from config import (ServerName, UserName, Password, port)
import psycopg2


def getData(DataBase, sql):
    engine = create_engine(f'postgres+psycopg2://{UserName}:{Password}@{ServerName}:{port}/{DataBase}')
    df_query = pd.read_sql(sql, engine)
    return df_query

### Query of the Database using the Function

In [50]:
# Define the query
sql = "select * from salaries"

# Store the query in a dataframe Table = "Employee"
salaries_df = getData("Employee", sql)

# Print Dataframe
salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

## Barchart

### Bin Creation for Salaries

In [51]:
bins = [0, 49999, 59999, 69999, 79000, 89999,
        99999, 109999, 119999, 129999]

# Create labels for these bins
group_labels = ["0 to 49k", "50k to 59k", "60k to 69k", "70k to 79k", "80k to 89k", "90k to 99k",
                "100k to 109k", "110k to 119k", "120k to 129k"]

In [52]:
salaries_df["Salary Range"] = pd.cut(salaries_df["salary"], bins, labels=group_labels)
salaries_df.head()

   emp_no  salary   from_date     to_date Salary Range
0   10001   60117  1986-06-26  1987-06-26   60k to 69k
1   10002   65828  1996-08-03  1997-08-03   60k to 69k
2   10003   40006  1995-12-03  1996-12-02     0 to 49k
3   10004   40054  1986-12-01  1987-12-01     0 to 49k
4   10005   78228  1989-09-12  1990-09-12   70k to 79k

In [55]:
salaries_group_df = salaries_df.groupby("Salary Range")
salaries_barchart_df = salaries_group_df[["salary"]].count()
salaries_barchart_df
salaries_barchart_df.rename(columns={"salary" : "No. of Employees"})

              No. of Employees
Salary Range
0 to 49k                158465
50k to 59k               57915
60k to 69k               41413
70k to 79k               23064
80k to 89k               13595
90k to 99k                4284
100k to 109k              1069
110k to 119k               195
120k to 129k                24